Управление_торговлей.ПБТ/src/Documents/вт_ПланПроизводства/вт_ПланПроизводства.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>вт_ПланПроизводства</name>
  <basedOn>Document.вт_ЗаказВПроизводство</basedOn>
  <registerRecords>AccumulationRegister.вт_ПланПроизводстваТоваров</registerRecords>
  <registerRecords>AccumulationRegister.вт_ПлановаяСебестоимостьВыпуска</registerRecords>
  <registerRecords>InformationRegister.вт_СтатусыЗаказовВПроизводство</registerRecords>
  <registerRecords>AccumulationRegister.ПланПроизводства</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусПланаПроизводства</name>
    <type>
      <types>EnumRef.вт_СтатусыПроизводства</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладОсновной</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладПроизводства</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснования</name>
    <type>
      <types>DocumentRef.вт_ЗаказВПроизводство</types>
      <types>DocumentRef.ЗаказКлиента</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
    </type>
  </attributes>
  <attributes>
    <name>НормативныйВидЦен</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособРасчетаСебестоимости</name>
    <type>
      <types>EnumRef.вт_ВариантРасчетаПлановойСебестоимости</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтчетПроизводстваФормироватьРегламентнымЗаданием</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПланирования</name>
    <type>
      <types>EnumRef.вт_ВидыПланированияПроизводства</types>
    </type>
  </attributes>
  <tabularSections>
    <name>РеквизитПланПоЗаказам</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекущийОстаток</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВЗаказе</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Заказ</name>
      <type>
        <types>DocumentRef.вт_ЗаказВПроизводство</types>
      </type>
    </attributes>
    <attributes>
      <name>ВариантПроизводства</name>
      <type>
        <types>CatalogRef.вт_ВариантыПроизводстваПоТехКартам</types>
      </type>
    </attributes>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РеквизитТаблицаПлана</name>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекущийОстаток</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МаксЗапас</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КритическийОстаток</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПланПроизводства</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ГотоваяПродукция</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ПотребностьПоготовойПродукции</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КлючСтроки</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ПлановаяЦена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Товары</name>
    <comment>Таблица товров, для которых нужно изготовить продукцию</comment>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>МинимальныйОстаток</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МаксимальныйОстаток</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВПроизводство</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВсегоОстаток</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Выбрано</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ВариантПроизводства</name>
      <type>
        <types>CatalogRef.вт_ВариантыПроизводстваПоТехКартам</types>
      </type>
    </attributes>
    <attributes>
      <name>КодСтрокиРодитель</name>
      <comment>Код родительской строки когда есть зависимые полуфабрикаты</comment>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ПлановаяЦена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОстаткиТоваровПоскладам</name>
    <comment>Остатки товаров по складам на момент работы с документом</comment>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
    <attributes>
      <name>Остаток</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КлючСтроки</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОстаткиКомплектовПоСкладам</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
    <attributes>
      <name>Остаток</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПланПоОперциям</name>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ГотоваяПродукция</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Норма</name>
      <comment>Норматив выполнения</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПлановаяЦена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КлючСтроки</name>
      <comment>Ссылка на производимое изделие в ТЧ Товары</comment>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Управление_торговлей.ПБТ/src/AccumulationRegisters/ТоварыНаСкладах/ТоварыНаСкладах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="80440cbb-f97b-4620-8eca-b89f9a033f08">
  <name>ТоварыНаСкладах</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <registerType>Checked</registerType>
  </extension>
  <resources extendedConfigurationObject="2d1fe73e-1f3d-4ee9-9dd1-010dfff742b1">
    <name>ВНаличии</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="d7a580fb-b3d4-4540-9057-2bf42dbcce49">
    <name>КОтгрузке</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <dimensions extendedConfigurationObject="70b08d50-30e9-4115-9e39-67ef989c58b2">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="29d5a4e7-4544-4ed2-a8bf-d541eef13703">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="32c528cc-88fa-48ca-967d-eb0035bcc3a8">
    <name>Серия</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:AccumulationRegister>

Управление_торговлей.ПБТ/src/AccumulationRegisters/вт_ПланПроизводстваТоваров/вт_ПланПроизводстваТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>вт_ПланПроизводстваТоваров</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаказПроизводства</name>
    <type>
      <types>DocumentRef.вт_ЗаказВПроизводство</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Управление_торговлей.ПБТ/src/AccumulationRegisters/ПланПроизводства/ПланПроизводства.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ПланПроизводства</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Управление_торговлей.ПБТ/src/Documents/вт_ПланПроизводства/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) 
 	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.вт_ЗаказВПроизводство") Тогда
		ЭтотОбъект.ДокументОснования = ДанныеЗаполнения;
		ЭтотОбъект.СкладОсновной = КонстантыСервер.ПолучитьЗначениеКонстанты("вт_ОсновнойСклад");
		 ЭтотОбъект.СкладПроизводства = КонстантыСервер.ПолучитьЗначениеКонстанты("вт_СкладПроизводства");
		//Заполняем план производства из заказ производства
		ЭтотОбъект.Организация = ДанныеЗаполнения.Организация; 
		Для Каждого СтрокаЗаказа из ДанныеЗаполнения.ТОвары Цикл
			Если НЕ ЕстьВариантыПроизводства(СтрокаЗаказа.Номенклатура) Тогда
				Продолжить;
			КонецЕсли;
			НовСтрока = ЭтотОбъект.Товары.Добавить();
			НовСтрока.Выбрано = Истина;
			НовСтрока.Номенклатура = СтрокаЗаказа.Номенклатура;
			НовСтрока.ВПроизводство = СтрокаЗаказа.Количество;
			НовСтрока.МинимальныйОстаток = НовСтрока.ВПроизводство;
			НовСтрока.МаксимальныйОстаток = НовСтрока.ВПроизводство;
			НовСтрока.КодСтроки = СтрокаЗаказа.КлючСтроки;
			НовСтрока.ВариантПроизводства = СтрокаЗаказа.ВариантПроизводства;
			
			МассивСтрокСырье = ДанныеЗаполнения.Сырье.НайтиСтроки(Новый Структура("КлючСвязиСтроки",СтрокаЗаказа.КлючСтроки));
			Если МассивСтрокСырье.Количество()>0 Тогда //Если в заказе производства задано сырье
				Для Каждого СтрокаСырьеЗаказа из МассивСтрокСырье Цикл
					СтрокаПлана = ЭтотОбъект.РеквизитТаблицаПлана.Добавить();
					СтрокаПлана.КодСтроки = Новый УникальныйИдентификатор;
					СтрокаПлана.КлючСтроки = НовСтрока.КодСтроки;
					СтрокаПлана.Номенклатура = СтрокаСырьеЗаказа.Номенклатура; //Добавляем сырье
					СтрокаПлана.ГотоваяПродукция = НовСтрока.Номенклатура;
					СтрокаПлана.ПотребностьПоготовойПродукции = СтрокаСырьеЗаказа.Количество;
					СтрокаПлана.ПланПроизводства = СтрокаЗаказа.Количество;
					Если ЕстьВариантыПроизводства(СтрокаПлана.Номенклатура) Тогда //Если эту часть сырья саму нужно произвести
							НовСтрока2 = ЭтотОбъект.Товары.Добавить();
							НовСтрока2.Выбрано = Истина;
							НовСтрока2.Номенклатура = СтрокаПлана.Номенклатура;
							НовСтрока2.ВПроизводство = СтрокаПлана.ПотребностьПоготовойПродукции;
							НовСтрока2.МинимальныйОстаток = СтрокаПлана.Номенклатура.вт_МинимальныйЗапас;
							НовСтрока2.МаксимальныйОстаток = СтрокаПлана.Номенклатура.вт_МаксимальныйЗапас;
							НовСтрока2.КодСтроки = СтрокаПлана.КодСтроки; //Код строки в таблице продукции и плана по сырью должен совпадать
							НовСтрока2.КодСтрокиРодитель = НовСтрока.КодСтроки; //Подчинен исходному производимому изделию
							НовСтрока2.ВариантПроизводства = ПолучитьВариантПроизводстваПродукции(НовСтрока2.Номенклатура);
							
							ЗаполнитьЭлементыПроизводства(СтрокаПлана.Номенклатура, СтрокаПлана.ПланПроизводства, НовСтрока2.КодСтроки); //рекурсивно вызываем заполнение производства самой этой детали
					КонецЕсли;
					
				КонецЦикла;
			Иначе //Если в заказе не указано, то заполняем по рецептурам
				ЗаполнитьЭлементыПроизводства(НовСтрока.Номенклатура, НовСтрока.ВПроизводство, НовСтрока.КодСтроки);
			КонецЕсли;
		КонецЦикла;
	    ОбновитьТекущиеОстаткиПоПлануГотовойПродукции();
		
   КонецЕсли;
КонецПроцедуры	

Функция  ПолучитьВариантПроизводстваПродукции(Номенклатура) 
	Возврат вт_ОбщийМодульПроизводства.ПолучитьВариантПроизводстваПродукции(Номенклатура).Ссылка;
КонецФункции
	
Процедура ЗаполнитьЭлементыПроизводства(ПроизводимаяНоменклатура, КолВоПроизводство, КлючСтроки) Экспорт
	//Берем первый попавшийся вариант производства
	ВариантПроизводства = Справочники.вт_ВариантыПроизводстваПоТехКартам.ПустаяСсылка();
	МассивСтрокТовары = ЭтотОбъект.Товары.НайтиСтроки(Новый Структура("КодСтроки",КлючСтроки));
	ТекСтрокаПродукции = Неопределено;
	
	Если МассивСтрокТовары.Количество()>0 Тогда
		ТекСтрокаПродукции  = МассивСтрокТовары[0];
		ВариантПроизводства = ТекСтрокаПродукции.ВариантПроизводства;
	КонецЕсли;
	
	Если ВариантПроизводства.пустая() И ТекСтрокаПродукции<>Неопределено тогда
		 ВыборкаВариантов = Справочники.вт_ВариантыПроизводстваПоТехКартам.Выбрать(,ПроизводимаяНоменклатура);
		
		Пока ВыборкаВариантов.Следующий() Цикл
			Если (ТекСтрокаПродукции.Характеристика = ВыборкаВариантов.Характеристика)
				 ИЛИ НЕ ЗначениеЗаполнено(ТекСтрокаПродукции.Характеристика) Тогда
				 
				 Если ВыборкаВариантов.Основной Тогда
					 ВариантПроизводства = ВыборкаВариантов.Ссылка;
					 Прервать;
				 КонецЕсли;	
				 
				 Если  НЕ ВыборкаВариантов.ПометкаУдаления Тогда
					 ВариантПроизводства = ВыборкаВариантов.Ссылка;
				 КонецЕсли;	
			КонецЕсли;
			 
		КонецЦикла;
		ТекСтрокаПродукции.ВариантПроизводства = ВариантПроизводства;
	КонецЕсли;

	Если ВариантПроизводства.Пустая() ТОгда
		Возврат;
	КонецЕсли;
	
	//Сначала очищаем
	СтрокаПлана = ЭтотОбъект.РеквизитТаблицаПлана.НайтиСтроки(Новый Структура("КлючСтроки",КлючСтроки));
	Для Каждого СтрокаПлана из СтрокаПлана Цикл
		ЭтотОбъект.РеквизитТаблицаПлана.Удалить(СтрокаПлана);
	КонецЦикла;
	
	СтрокиОперации = ЭтотОбъект.ПланПоОперциям.НайтиСтроки(Новый Структура("КлючСтроки",КлючСтроки));
	Для Каждого СтрокаПлана из СтрокиОперации Цикл
		ЭтотОбъект.ПланПоОперциям.Удалить(СтрокаПлана);
	КонецЦикла;
	
	
	//Заполняем
	Для Каждого СтрокаВариантаПроизводства из ВариантПроизводства.Состав Цикл //Берем содержимое техкарты
		 СтрокаПлана = ЭтотОбъект.РеквизитТаблицаПлана.Добавить();
		 СтрокаПлана.КодСтроки = Новый УникальныйИдентификатор;
		 СтрокаПлана.КлючСтроки = КлючСтроки;
		 СтрокаПлана.Номенклатура = СтрокаВариантаПроизводства.Сырье; //Добавляем сырье
		 СтрокаПлана.ГотоваяПродукция = ПроизводимаяНоменклатура;
		 СтрокаПлана.ПотребностьПоготовойПродукции = КолВоПроизводство * СтрокаВариантаПроизводства.Количество/?(ВариантПроизводства.Количество>0,ВариантПроизводства.Количество,1);
		 СтрокаПлана.ПланПроизводства = СтрокаПлана.ПотребностьПоготовойПродукции;
		 
		 Если ЕстьВариантыПроизводства(СтрокаПлана.Номенклатура) Тогда //Если эту часть сырья саму нужно произвести
			 //Проверяем, может она уже есть
			 СтрокиТовары = ЭтотОбъект.Товары.НайтиСтроки(Новый Структура("КодСтрокиРодитель",КлючСтроки));
			 Для Каждого СтрокаТовара из СтрокиТовары Цикл
				 ЭтотОбъект.Товары.Удалить(СтрокаТовара);
			 КонецЦикла;
			 
			 ОтборПоТовару= Новый Структура("Номенклатура, КодСтрокиРодитель",СтрокаПлана.Номенклатура, КлючСтроки);
			 НайденыСтроки = ЭтотОбъект.Товары.НайтиСтроки(ОтборПоТовару);
			 Если НайденыСтроки.Количество()=0 ТОгда
				 НовСтрока = ЭтотОбъект.Товары.Добавить();
				 НовСтрока.Выбрано = Истина;
				 НовСтрока.Номенклатура = СтрокаПлана.Номенклатура;
				 НовСтрока.ВПроизводство = СтрокаПлана.ПотребностьПоготовойПродукции;
				 //НовСтрока.МинимальныйОстаток = СтрокаПлана.Номенклатура.вт_МинимальныйЗапас;
				 //НовСтрока.МаксимальныйОстаток = СтрокаПлана.Номенклатура.вт_МаксимальныйЗапас;
				 НовСтрока.КодСтроки = СтрокаПлана.КодСтроки;
				 НовСтрока.КодСтрокиРодитель = КлючСтроки; //Ставим ссылку на родительский элемент - для кого делаем
				 НовСтрока.ВариантПроизводства = ПолучитьВариантПроизводстваПродукции(НовСтрока.Номенклатура); 
				 
				 ЗаполнитьЭлементыПроизводства(СтрокаПлана.Номенклатура, СтрокаПлана.ПланПроизводства, НовСтрока.КодСтроки); //рекурсивно вызываем заполнение производства самой этой детали
			 КонецЕсли;
			  Продолжить;
		 КонецЕсли;
		
	КонецЦикла;	
	
	//Заполняем операции
	Для Каждого СтрокаВариантаПроизводства из ВариантПроизводства.Операции Цикл //Берем содержимое техкарты - операции
		СтрокаПланаОпераций = ПланПоОперциям.Добавить();
		СтрокаПланаОпераций.КодСтроки = Новый УникальныйИдентификатор;
		СтрокаПланаОпераций.КлючСтроки = КлючСтроки;
		СтрокаПланаОпераций.ГотоваяПродукция = ПроизводимаяНоменклатура;
		СтрокаПланаОпераций.Номенклатура = СтрокаВариантаПроизводства.Операция;
		СтрокаПланаОпераций.Норма = КолВоПроизводство  *  СтрокаВариантаПроизводства.НормаВремени / ВариантПроизводства.Количество;
	КонецЦикла;
КонецПроцедуры	

Процедура ОбновитьТекущиеОстаткиПоПлануГотовойПродукции() Экспорт
	//По таблице Товары определить текущие остатки и скорректировать план в производство
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ВТ_ПлановыеТовары.Номенклатура
	                      |ПОМЕСТИТЬ ВТ_ПЛАНОВЫЕ
	                      |ИЗ
	                      |	&ВТ_ПлановыеТовары КАК ВТ_ПлановыеТовары
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ВТ_ПЛАНОВЫЕ.Номенклатура,
	                      |	естьnull(ТоварыОрганизацийОстатки.КоличествоОстаток,0) КАК КоличествоОстаток,
	                      |	естьnull(ТоварыНаСкладахОстатки.ВНаличииОстаток,0) КАК ВНаличииОстаток
	                      |ИЗ
	                      |	ВТ_ПЛАНОВЫЕ КАК ВТ_ПЛАНОВЫЕ
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыОрганизаций.Остатки(&ГраницаОстатка, Организация = &Организация) КАК ТоварыОрганизацийОстатки
	                      |		ПО ВТ_ПЛАНОВЫЕ.Номенклатура = ТоварыОрганизацийОстатки.АналитикаУчетаНоменклатуры.Номенклатура
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(&ГраницаОстатка, Склад В (&Склады)) КАК ТоварыНаСкладахОстатки
	                      |		ПО ВТ_ПЛАНОВЫЕ.Номенклатура = ТоварыНаСкладахОстатки.Номенклатура");	
	МассивСклады = Новый Массив;
	МассивСклады.Добавить(ЭтотОбъект.СкладОсновной);
	МассивСклады.Добавить(ЭтотОбъект.СкладПроизводства);
	
	Запрос.УстановитьПараметр("ГраницаОстатка",Новый МоментВремени(ТекущаяДата()));
	Запрос.УстановитьПараметр("ВТ_ПлановыеТовары", ЭтотОбъект.Товары);
	Запрос.УстановитьПараметр("Склады",МассивСклады);
	Запрос.УстановитьПараметр("Организация",ЭтотОбъект.Организация);
	
	ТаблОстатки = Запрос.Выполнить().Выгрузить();
	Для Каждого СтрокаПлана из ЭтотОбъект.Товары ЦИкл
		   ОтборСтрок = Новый Структура("Номенклатура",СтрокаПлана.Номенклатура);
		   НайденыСтроки = ТаблОстатки.НайтиСтроки(ОтборСтрок);
		   СтрокаПлана.ВсегоОстаток = 0;
		   Если НайденыСтроки.Количество()>0 Тогда
			   СтрокаПлана.ВсегоОстаток = ?(НайденыСтроки[0].КоличествоОстаток>0,НайденыСтроки[0].КоличествоОстаток, НайденыСтроки[0].ВНаличииОстаток);
		   КонецЕсли;
		   
	КонецЦикла;
	
	//Обновляем остатки по сырью
	Запрос.УстановитьПараметр("ВТ_ПлановыеТовары", ЭтотОбъект.РеквизитТаблицаПлана);
	ТаблОстатки = Запрос.Выполнить().Выгрузить();
	Для Каждого СтрокаПлана из ЭтотОбъект.РеквизитТаблицаПлана ЦИкл
		   ОтборСтрок = Новый Структура("Номенклатура",СтрокаПлана.Номенклатура);
		   НайденыСтроки = ТаблОстатки.НайтиСтроки(ОтборСтрок);
		   СтрокаПлана.ТекущийОстаток = 0;
		   Если НайденыСтроки.Количество()>0 Тогда
			   СтрокаПлана.ТекущийОстаток = ?(НайденыСтроки[0].КоличествоОстаток>0,НайденыСтроки[0].КоличествоОстаток, НайденыСтроки[0].ВНаличииОстаток);
		   КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры


Функция ЕстьВариантыПроизводства(пНоменклатура) Экспорт
	РезультатОтвета = Ложь;
	ВыборкаВариантов = Справочники.вт_ВариантыПроизводстваПоТехКартам.Выбрать(,пНоменклатура);
	Пока ВыборкаВариантов.Следующий() Цикл
		 РезультатОтвета = РезультатОтвета ИЛИ НЕ ВыборкаВариантов.ПометкаУдаления; //Нас интересует что бы был хотя бы один вариант прозводства не помеченный на удаление
	КонецЦикла;
	 
	Возврат РезультатОтвета;
КонецФункции


Процедура ОбработкаПроведения(Отказ, РежимПроведения) 
	ЗаписатьПлановуюСебестоимость();
	ЗаписатьПланПроизводства();
КонецПроцедуры	

Процедура ЗаписатьПлановуюСебестоимость()
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	&Период КАК Период,
	                      |	&ПланЗаказ КАК ПланЗаказ,
						  |	вт_ПланПроизводстваРеквизитТаблицаПлана.Номенклатура,
	                      |	вт_ПланПроизводстваРеквизитТаблицаПлана.ГотоваяПродукция КАК КоррНоменклатура,
	                      |	вт_ПланПроизводстваРеквизитТаблицаПлана.ПлановаяЦена  КАК Себестоимость
	                      |ИЗ
	                      |	Документ.вт_ПланПроизводства.РеквизитТаблицаПлана КАК вт_ПланПроизводстваРеквизитТаблицаПлана
	                      |ГДЕ
	                      |	вт_ПланПроизводстваРеквизитТаблицаПлана.Ссылка = &Ссылка И вт_ПланПроизводстваРеквизитТаблицаПлана.ПлановаяЦена <> 0
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ
						  |	&Период КАК Период,
						  |	&ПланЗаказ КАК ПланЗаказ,
	                      |	вт_ПланПроизводстваПланПоОперциям.Номенклатура,
	                      |	вт_ПланПроизводстваПланПоОперциям.ГотоваяПродукция,
	                      |	вт_ПланПроизводстваПланПоОперциям.ПлановаяЦена * вт_ПланПроизводстваПланПоОперциям.Норма
	                      |ИЗ
	                      |	Документ.вт_ПланПроизводства.ПланПоОперциям КАК вт_ПланПроизводстваПланПоОперциям
	                      |ГДЕ
	                      |	вт_ПланПроизводстваПланПоОперциям.Ссылка = &Ссылка
	                      | И вт_ПланПроизводстваПланПоОперциям.ПлановаяЦена * вт_ПланПроизводстваПланПоОперциям.Норма<>0
						  |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ
						  |	&Период КАК Период,
						  |	&ПланЗаказ КАК ПланЗаказ,
	                      |	вт_ПланПроизводстваТовары.Номенклатура,
	                      |	NULL,
	                      |	вт_ПланПроизводстваТовары.ПлановаяЦена
	                      |ИЗ
	                      |	Документ.вт_ПланПроизводства.Товары КАК вт_ПланПроизводстваТовары
	                      |ГДЕ
	                      |	вт_ПланПроизводстваТовары.Ссылка = &Ссылка
	                      |	И вт_ПланПроизводстваТовары.КодСтрокиРодитель = &КодСтрокиРодительПустой
						  | И вт_ПланПроизводстваТовары.ПлановаяЦена <> 0");
		
		Запрос.УстановитьПараметр("Ссылка",ЭтотОбъект.Ссылка);
		Запрос.УстановитьПараметр("ПланЗаказ",?(ЗначениеЗаполнено(ЭтотОбъект.ДокументОснования),ЭтотОбъект.ДокументОснования,ЭтотОбъект.Ссылка));
		Запрос.УстановитьПараметр("КодСтрокиРодительПустой", Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));
		Запрос.УстановитьПараметр("Период", ЭтотОбъект.Дата);
		ЭтотОбъект.Движения.вт_ПлановаяСебестоимостьВыпуска.Записывать=Истина;
		ЭтотОбъект.Движения.вт_ПлановаяСебестоимостьВыпуска.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

Функция НайтиЗаказПроизводстваПоКодуПродукции(КодСтроки) Экспорт
	Если ЗначениеЗаполнено(ЭтотОбъект.ДокументОснования) Тогда
		Возврат ЭтотОбъект.ДокументОснования;
	КонецЕсли;
	
	МассивСтрокПоЗаказам = ЭтотОбъект.РеквизитПланПоЗаказам.НайтиСтроки(Новый Структура("КодСтроки",КодСтроки));
	Если МассивСтрокПоЗаказам.количество()>0 Тогда
		 Возврат МассивСтрокПоЗаказам[0].Заказ;
	КонецЕсли;	
	
	
	МассивСтрокПоТоварам = ЭтотОбъект.Товары.НайтиСтроки(Новый Структура("КодСтроки",КодСтроки));
	Для Каждого ЭлементСтрокиТовары из МассивСтрокПоТоварам Цикл
		ЗаказПроизводства = НайтиЗаказПроизводстваПоКодуПродукции(ЭлементСтрокиТовары.КодСтрокиРодитель);
		Если ЗаказПроизводства<>Неопределено Тогда
			Возврат ЗаказПроизводства;
		КонецЕсли;	
	КонецЦикла;	
	
	Возврат Неопределено;
	 
КонецФункции

Процедура ЗаписатьПланПроизводства()
	
	ПустоеКод = Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000");
	
	Движения.вт_ПланПроизводстваТоваров.Записывать = Истина;
	Движения.ПланПроизводства.Записывать = Истина;
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		ЗаказДляЗаписи = Неопределено;
		Если ЗначениеЗаполнено(ДокументОснования) Тогда
			ЗаказДляЗаписи =   ДокументОснования;
		Иначе
			 ЗаказДляЗаписи = НайтиЗаказПроизводстваПоКодуПродукции(ТекСтрокаТовары.КодСтроки);
		КонецЕсли;	
		
		Движение = Движения.вт_ПланПроизводстваТоваров.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.ЗаказПроизводства = ЗаказДляЗаписи;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.Количество = ТекСтрокаТовары.ВПроизводство;
		
		Движение = Движения.ПланПроизводства.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.Количество = ТекСтрокаТовары.ВПроизводство;
		
	КонецЦикла;

	
КонецПроцедуры
